### 데이터 설명 : 은행의 전화 마케팅에 대해 고객의 반응 여부

In [4]:
import pandas as pd
data1 = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')
data1.head()

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no

Q1. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 인원을 가진 나이대는? (0-9 : 0, 10-19 : 10)

In [12]:
# import math, math.floor() 사용?

data1['age_'] = data1['age'] // 10
data1['age_']

0        2
1        2
2        3
3        4
4        2
        ..
12865    4
12866    3
12867    3
12868    4
12869    2
Name: age_, Length: 12870, dtype: int64

In [10]:
data1['age_'].value_counts()

3    5056
4    3198
5    2244
2    1638
6     460
7     193
8      57
1      18
9       6
Name: age_, dtype: int64

In [11]:
print(30)

30

Q2. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 나이대 구간의 인원은 몇명인가?

In [14]:
print(5056)

5056

Q3. 나이가 25살 이상 29살 미만인 응답 고객들중 housing컬럼의 값이 yes인 고객의 수는?

In [17]:
len(data1[(data1['age']>=25) & (data1['age']<29) & (data1['housing']=='yes')])

504

Q4. numeric한 값을 가지지 않은 컬럼들중 unique한 값을 가장 많이 가지는 컬럼은?

In [22]:
condition = data1.columns[data1.dtypes =='object']
data1[condition].nunique()

job          12
marital       3
education     4
default       2
housing       2
loan          2
contact       3
month        12
poutcome      4
y             2
dtype: int64

In [24]:
print('job', 'month')

job month

In [31]:
# 다른 풀이
data1.select_dtypes(include='object').nunique()

job          12
marital       3
education     4
default       2
housing       2
loan          2
contact       3
month        12
poutcome      4
y             2
dtype: int64

Q5. balance 컬럼값들의 평균값 이상을 가지는 데이터를 ID값을 기준으로 내림차순 정렬했을때 상위 100개 데이터의 balance값의 평균은?

In [39]:
data1[data1['balance']>=data1['balance'].mean()].sort_values(by=['ID'], ascending=False)[:100].balance.mean()

3473.73

Q6. 가장 많은 광고를 집행했던 날짜는 언제인가? (데이터 그대로 일(숫자),달(영문)으로 표기)

In [47]:
data1.groupby(['day', 'month']).size().sort_values(ascending=False)

day  month
15   may      301
14   may      283
13   may      257
7    may      239
21   nov      221
             ...
4    oct        1
30   dec        1
     aug        1
19   mar        1
21   jun        1
Length: 303, dtype: int64

In [48]:
data1.groupby(['day', 'month']).size().sort_values(ascending=False).index[0]

(15, 'may')

Q7. 데이터의 job이 unknown 상태인 고객들의 age 컬럼 값의 정규성을 검정하고자 한다. 샤피로 검정의 p-value값을 구하여라

In [52]:
from scipy.stats import shapiro

shapiro(data1[data1.job=='unknown'].age)

ShapiroResult(statistic=0.9784722924232483, pvalue=0.19612720608711243)

Q8. age와 balance의 상관계수를 구하여라

In [54]:
data1[['age', 'balance']].corr()

              age   balance
age      1.000000  0.101987
balance  0.101987  1.000000

In [56]:
data1[['age', 'balance']].corr().iloc[1, 0]

0.10198734763981462

Q9. y 변수와 education 변수는 독립인지 카이제곱검정을 통해 확인하려한다. p-value값을 출력하라

In [57]:
from scipy.stats import chi2_contingency

In [63]:
table = pd.crosstab(data1.y, data1.education)
table

education  primary  secondary  tertiary  unknown
y
no            1424       4555      2559      365
yes            456       1813      1516      182

In [64]:
print(chi2_contingency(table))

(133.87601246919445, 7.901201277473551e-29, 3, array([[1300.51592852, 4405.15182595, 2818.93745144,  378.39479409],
       [ 579.48407148, 1962.84817405, 1256.06254856,  168.60520591]]))

In [65]:
statistics, pvalue, ddof, ef = chi2_contingency(table)
pvalue

7.901201277473551e-29

Q10. 각 job에 따라 divorced/married 인원의 비율을 확인 했을 때 그 값이 가장 높은 값은?

In [77]:
data1.groupby(['job', 'marital']).size()

job            marital
admin.         divorced     207
               married      762
               single       495
blue-collar    divorced     205
               married     1775
               single       591
entrepreneur   divorced      44
               married      272
               single        67
housemaid      divorced      49
               married      245
               single        40
management     divorced     323
               married     1580
               single       955
retired        divorced     157
               married      572
               single        41
self-employed  divorced      39
               married      284
               single       131
services       divorced     138
               married      584
               single       321
student        married       24
               single       334
technician     divorced     246
               married     1115
               single       780
unemployed     divorced      62
               married      219
               single       133
unknown        divorced       5
               married       58
               single        17
dtype: int64

In [82]:
data1[(data1.marital=='divorced') | (data1.marital=='married')].groupby(['job', 'marital']).size()

job            marital
admin.         divorced     207
               married      762
blue-collar    divorced     205
               married     1775
entrepreneur   divorced      44
               married      272
housemaid      divorced      49
               married      245
management     divorced     323
               married     1580
retired        divorced     157
               married      572
self-employed  divorced      39
               married      284
services       divorced     138
               married      584
student        married       24
technician     divorced     246
               married     1115
unemployed     divorced      62
               married      219
unknown        divorced       5
               married       58
dtype: int64

In [86]:
# 일일이 나누거나, 반복문을 짤 수도 있었지만, 답안 예시를 참고해보자

t = data1.groupby(['job','marital']).size().reset_index()
pivotdf = t.pivot_table(index='job',columns='marital')[0]
pivotdf

marital        divorced  married  single
job
admin.            207.0    762.0   495.0
blue-collar       205.0   1775.0   591.0
entrepreneur       44.0    272.0    67.0
housemaid          49.0    245.0    40.0
management        323.0   1580.0   955.0
retired           157.0    572.0    41.0
self-employed      39.0    284.0   131.0
services          138.0    584.0   321.0
student             NaN     24.0   334.0
technician        246.0   1115.0   780.0
unemployed         62.0    219.0   133.0
unknown             5.0     58.0    17.0

In [89]:
pivotdf = pivotdf.fillna(0)
pivotdf['ratio'] = pivotdf['divorced'] / pivotdf['married']

pivotdf.sort_values('ratio', ascending=False)

marital        divorced  married  single     ratio
job
unemployed         62.0    219.0   133.0  0.283105
retired           157.0    572.0    41.0  0.274476
admin.            207.0    762.0   495.0  0.271654
services          138.0    584.0   321.0  0.236301
technician        246.0   1115.0   780.0  0.220628
management        323.0   1580.0   955.0  0.204430
housemaid          49.0    245.0    40.0  0.200000
entrepreneur       44.0    272.0    67.0  0.161765
self-employed      39.0    284.0   131.0  0.137324
blue-collar       205.0   1775.0   591.0  0.115493
unknown             5.0     58.0    17.0  0.086207
student             0.0     24.0   334.0  0.000000

In [90]:
pivotdf.sort_values('ratio')

result = pivotdf.sort_values('ratio').ratio.values[-1]
print(result)

0.2831050228310502